In [1]:
import pandas as pd

s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
#series with custom index
s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s)

a    10
b    20
c    30
dtype: int64

In [4]:
# Access a Series element by label
print(s['b'])  # Output: 20

20

In [5]:
# Access a Series element by position
print(s.iloc[1])  # Output: 20

20

In [6]:
#Create DataFrame from dictionary
data = {'Name': ['Alice', 'Bob'], 'Age': [25, 30]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0  Alice   25
1    Bob   30

In [8]:
# Create DataFrame from list of dictionaries
data = [{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]
df = pd.DataFrame(data)
print(df)

   a  b
0  1  2
1  3  4

In [9]:
print(df.columns)

Index(['a', 'b'], dtype='object')

In [10]:
print(df.index)

RangeIndex(start=0, stop=2, step=1)

In [11]:
print(df['a'])

0    1
1    3
Name: a, dtype: int64

In [12]:
df['c'] = df['a'] + df['b']
print(df)

   a  b  c
0  1  2  3
1  3  4  7

In [13]:
del df['c']
print(df)

   a  b
0  1  2
1  3  4

In [14]:
df.rename(columns={'a': 'A', 'b': 'B'}, inplace=True)
print(df)

   A  B
0  1  2
1  3  4

In [15]:
#Write a DataFrame to CSV
df.to_csv('output.csv', index=False)

In [16]:
#Read a CSV file
df = pd.read_csv('output.csv')
print(df.head())

   A  B
0  1  2
1  3  4

In [20]:
#Read CSV with custom delimiter
df = pd.read_csv('output.csv', delimiter='\t')
df

   A,B
0  1,2
1  3,4

In [21]:
#Skip rows while reading
df = pd.read_csv('output.csv', skiprows=1)
df

   1  2
0  3  4

In [23]:
# Read csv without headers
df = pd.read_csv('output.csv', header=None)
df

   0  1
0  A  B
1  1  2
2  3  4

In [25]:
#Filter rows by condition
df = pd.DataFrame({'Age': [20, 25, 30], 'Name': ['A', 'B', 'C']})
print(df[df['Age'] > 21])

   Age Name
1   25    B
2   30    C

In [26]:
# Filter using multiple rows
print(df[(df['Age'] > 21) & (df['Name'] == 'C')])

   Age Name
2   30    C

In [27]:
print(df.query('Age > 21 and Name == "C"'))

   Age Name
2   30    C

In [28]:
df.sort_values(by='Age', inplace=True)
print(df)

   Age Name
0   20    A
1   25    B
2   30    C

In [30]:
df.sort_values(by='Age', ascending=False, inplace=True)
df

   Age Name
2   30    C
1   25    B
0   20    A

In [31]:
df.reset_index(drop=True, inplace=True)
df

   Age Name
0   30    C
1   25    B
2   20    A

In [32]:
#Set column as index
df.set_index('Name', inplace=True)
print(df)

      Age
Name
C      30
B      25
A      20

In [33]:
# select row by index labrl
print(df.loc['B'])

Age    25
Name: B, dtype: int64

In [35]:
# Select multiple columns
print(df[['Age']])

      Age
Name
C      30
B      25
A      20

In [36]:
# added new row
df.loc['D'] = [40]
print(df)

      Age
Name
C      30
B      25
A      20
D      40

In [39]:
#Drop a new row
df.drop('C', inplace=True)
df

      Age
Name
B      25
A      20

In [40]:
#checs for nulls
print(df.isnull())

        Age
Name
B     False
A     False

In [41]:
#Filling missing values
df.fillna(0, inplace=True)

In [42]:
#Replace values
df.replace(25, 100, inplace=True)
df

      Age
Name
B     100
A      20

In [43]:
#Apply function to colum
df['Age'] = df['Age'].apply(lambda x: x * 2)
print(df)

      Age
Name
B     200
A      40

In [45]:
#Add column based on condition
df['is_adult'] = df['Age'] > 18
print(df)

      Age  is_adult
Name
B     200      True
A      40      True

In [46]:
#Get summary statistics
print(df.describe())

              Age
count    2.000000
mean   120.000000
std    113.137085
min     40.000000
25%     80.000000
50%    120.000000
75%    160.000000
max    200.000000

In [47]:
#Group by and aggregate
df = pd.DataFrame({'Dept': ['HR', 'HR', 'IT'], 'Salary': [1000, 1500, 2000]})
print(df.groupby('Dept').mean())

      Salary
Dept
HR    1250.0
IT    2000.0

In [49]:
#Count values
print(df['Dept'].value_counts())

Dept
HR    2
IT    1
Name: count, dtype: int64

In [50]:
#unique values in column
print(df['Dept'].unique())

['HR' 'IT']

In [53]:
#Transpose
print(df.T)

           0     1     2
Dept      HR    HR    IT
Salary  1000  1500  2000

In [55]:
#copy a dataframe
df_copy = df.copy()
df_copy

  Dept  Salary
0   HR    1000
1   HR    1500
2   IT    2000